Revit 2027 API
SpacingRule.Layout Property
A choice of several gridline layout rules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpacingRuleLayout Layout { get; }
Public ReadOnly Property Layout As SpacingRuleLayout
	Get
public:
property SpacingRuleLayout Layout {
	SpacingRuleLayout get ();
}
member Layout : SpacingRuleLayout with get
Property Value
SpacingRuleLayout
Remarks
If "None" is chosen, no internal lines will be generated, but the effect is equivalent to having two lines, one at each end of the region.
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace